app/controllers/cities_controller.rb

	def show
		@city = City.friendly.find(params[:id])
		@posts = Post.where(city_id: @city).order("created_at DESC")
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = 1  ORDER BY created_at DESC