app/controllers/comments_controller.rb

  def create
  	if current_user
  		post = Post.find(params[:comment][:post_id])
  		comment = post.comments.new(comment_params)
  		if comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("description", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "tea and crumpets"], ["post_id", 4], ["created_at", "2015-08-13 19:47:41.621397"], ["updated_at", "2015-08-13 19:47:41.621397"]]