app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "city_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test test test"], ["city_id", 2], ["content", "whoooooo"], ["user_id", 1], ["created_at", "2015-08-12 15:49:37.970461"], ["updated_at", "2015-08-12 15:49:37.970461"]]
---
  def create

    if current_user
      post = current_user.posts.new(post_params)
        if post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 23]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "YAY San Francisco! :)"], ["content", "San Francisco is Awesome!"], ["updated_at", "2015-08-11 23:42:43.961437"], ["id", 22]]
---
  def update
    post_id = params[:id]
      post = Post.find(post_id)
    updated_attributes = post_params

    if post.update_attributes(updated_attributes)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 15]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 15]]
---
  def destroy
    id = params[:id]
    post = Post.find(id)
    post.destroy