app/controllers/sessions_controller.rb

	def create
        user = User.find_by(email:params[:sessions][:email]).try(:authenticate, params[:sessions][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "testing@testing.com"]]