app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "profile_image_file_name", "profile_image_content_type", "profile_image_file_size", "profile_image_updated_at", "email", "current_city", "password_digest", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def show
    @user = User.friendly.find(session[:user_id])
    @posts = Post.where(user_id: current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1

  def edit
    @user = User.friendly.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    user = User.friendly.find(session[:user_id])
    if current_user = user
      form_params = params.require(:user).permit(:first_name, :last_name, :profile_image, :current_city)
      user.update_attributes(form_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "profile_image_updated_at" = $1, "profile_image_file_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["profile_image_updated_at", "2015-08-11 17:48:26.112469"], ["profile_image_file_name", "code-academy.jpg"], ["updated_at", "2015-08-11 17:48:27.256139"], ["id", 5]]